<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"d9ff1405a14dc4e803c38d596977361e4b557c3748f6c9211ee6d4456774120c","plan_job_ref":"Job TF Plan #18 at https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4732344419","plan_hash":"d60d6d3a8d879103d3e6fc1b9a748b3e3781127691103ba121ea0e0a297fe2e8","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __secure-linux-jump__
With backend config: `resource_group_name=ampe-state-sandbox-resourcegroup-nwqlx-rg
storage_account_name=ampestatesandboxsadojob
container_name=ampe-state-sandbox-sc-ndkad-stct
key=slj.terraform.tfstate`
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.azbas will be created
  + resource "azurerm_bastion_host" "azbas" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "AMPE-dev-linux-vm-azure-bastion-nprtn-bast"
      + resource_group_name    = "AMPE-dev-linux-vm-Hub-Resourcegroup-ibift-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "****************************************************************************************************************************************************************************************************************************"
        }
    }

  # azurerm_linux_virtual_machine.linuxjb will be created
  + resource "azurerm_linux_virtual_machine" "linuxjb" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = "linux-vmjump"
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "AMPE-dev-linux-vm-linux-JB-tsqcy-vm"
      + network_interface_ids           = [
          + "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/AMPE-dev-linux-vm-Linux-Resourcegroup-inbyo-rg/providers/Microsoft.Network/networkInterfaces/AMPE-dev-linux-vm-linux-vm-vylye-nic",
        ]
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "AMPE-dev-linux-vm-Linux-Resourcegroup-inbyo-rg"
      + size                            = "Standard_F2"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface_security_group_association.nicNSG will be created
  + resource "azurerm_network_interface_security_group_association" "nicNSG" {
      + id                        = (known after apply)
      + network_interface_id      = "****************************************************************************************************************************************************************************************************"
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.hub_nsg will be created
  + resource "azurerm_network_security_group" "hub_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "AMPE-dev-linux-vm-hub_nsg-jbsxl-nsg"
      + resource_group_name = "AMPE-dev-linux-vm-Hub-Resourcegroup-ibift-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "initial-testing"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_network_security_group.linuxnsg will be created
  + resource "azurerm_network_security_group" "linuxnsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "AMPE-dev-linux-vm-linux_nsg-ytoib-nsg"
      + resource_group_name = "AMPE-dev-linux-vm-Linux-Resourcegroup-inbyo-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "initial-testing"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.hub-bas-pip will be created
  + resource "azurerm_public_ip" "hub-bas-pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "AMPE-dev-linux-vm-bas-pip-gsjac-pip"
      + resource_group_name     = "AMPE-dev-linux-vm-Hub-Resourcegroup-ibift-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [TF Plan #18](https://github.com/AFMPE/AMPE_SANDBOX/actions/runs/4732344419)